       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           CALL 'prog2' USING 'HelloWorld'.
           STOP RUN.