IDENTIFICATION DIVISION.
       PROGRAM-ID. prog3.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       HelloWorld.
           DISPLAY 'Hello, World!'.
           STOP RUN.