       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog2.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       SECOND-PROCEDURE.
           CALL 'prog3' USING 'HelloWorld'.
           STOP RUN.